app/views/evaluations/index.html.erb

SELECT "templates".* FROM "templates" WHERE "templates"."id" = 10 LIMIT 1
SELECT COUNT(*) FROM "pergunta" WHERE "pergunta"."template_id" = 10
---
                        <small class="text-muted">
                          <%= pluralize(formulario.template.pergunta.count, 'pergunta') %>

SELECT "submissoes_concluidas".* FROM "submissoes_concluidas" WHERE "submissoes_concluidas"."formulario_id" = 2 AND "submissoes_concluidas"."user_id" = 2 LIMIT 1
---
                        </small>
                        <% submissao = formulario.submissoes_concluidas.find_by(user: current_user) %>