app/services/import_service.rb

        next if user_data['email'].blank?

        # Verifica se o usuário já existe
        existing_user = User.find_by(email: user_data['email'])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'acjpjvjp@gmail.com' LIMIT 1

          formacao: user_data['formacao']
        )

        if user.save
---
INSERT INTO "users" ("email", "name", "matricula", "role", "created_at", "updated_at", "reset_password_token", "reset_password_sent_at", "remember_created_at", "encrypted_password", "curso", "departamento", "formacao") VALUES ('acjpjvjp@gmail.com', 'Ana Clara Jordao Perna', '190084006', 1, '2025-07-12 16:02:29.878379', '2025-07-12 16:02:29.878379', NULL, NULL, NULL, '$2a$12$P2Kv38s8WdTuXHiAIRrw8eBh2bnM0LjO9Vf/CQPfJZPAm4yuajb32', 'CIÊNCIA DA COMPUTAÇÃO/CIC', NULL, 'graduando') RETURNING "id"

  def self.import_disciplines(data)
    imported = 0
    skipped = 0
    errors = []

    ActiveRecord::Base.transaction do
      Array(data).each do |discipline_data|
        code = discipline_data['code']
        name = discipline_data['name']
        next if code.blank? || name.blank?

        # Verifica se já existe um curso para essa disciplina
        curso_name = extract_course_from_code(code)
        curso = Curso.find_or_create_by(nome: curso_name)

        # Verifica se a disciplina já existe
        existing_discipline = Disciplina.find_by(codigo: code, nome: name)
---
SELECT "cursos".* FROM "cursos" WHERE "cursos"."nome" = 'Ciência da Computação' LIMIT 1
SELECT "disciplinas".* FROM "disciplinas" WHERE "disciplinas"."codigo" = 'CIC0097' AND "disciplinas"."nome" = 'BANCOS DE DADOS' LIMIT 1

          disciplina.horario = class_info['time']
        end

        if disciplina.save
---
INSERT INTO "disciplinas" ("nome", "curso_id", "created_at", "updated_at", "codigo", "codigo_turma", "semestre", "horario") VALUES ('BANCOS DE DADOS', 2, '2025-07-12 16:02:02.018773', '2025-07-12 16:02:02.018773', 'CIC0097', 'TA', '2021.2', '35T45') RETURNING "id"