app/views/admin/management/index.html.erb

SELECT COUNT(*) FROM "users"
---
                <div class="stat-card">
                  <h4><%= User.count %></h4>

SELECT COUNT(*) FROM "disciplinas"
---
                <div class="stat-card">
                  <h4><%= Disciplina.count %></h4>

SELECT COUNT(*) FROM "cursos"
---
                <div class="stat-card">
                  <h4><%= Curso.count %></h4>