app/controllers/admin/management_controller.rb

SELECT COUNT(*) FROM "users" WHERE "users"."email" NOT IN ('admin@camaar.com', 'coordenador@camaar.com', 'professor@camaar.com', 'aluno@camaar.com')
SELECT COUNT(*) FROM "disciplinas"
---
    def imported_data_exists?
      # Verifica se já existem dados importados (excluindo usuários seed)
      seed_emails = ['admin@camaar.com', 'coordenador@camaar.com', 'professor@camaar.com', 'aluno@camaar.com']
      users_count = User.where.not(email: seed_emails).count
      disciplinas_count = Disciplina.count