app/views/templates/edit.html.erb

                    </span>
                    <%= form.select :disciplina_id,
                                    options_from_collection_for_select(current_user.disciplinas, :id, :nome, @template.disciplina_id),
                                    { prompt: "Selecione a disciplina" },
                                    { class: "form-select" } %>
---
SELECT "disciplinas".* FROM "disciplinas"

                <!-- Perguntas existentes -->
                <% @template.pergunta.order(:id).each_with_index do |pergunta, index| %>
---
SELECT "pergunta".* FROM "pergunta" WHERE "pergunta"."template_id" = 4 ORDER BY "pergunta"."id" ASC

<script>
document.addEventListener('DOMContentLoaded', function() {
  let perguntaCount = <%= @template.pergunta.count %>;
  let opcaoCount = 0;

  const addPerguntaBtn = document.getElementById('add-pergunta');
  const perguntasContainer = document.getElementById('perguntas-container');
  const perguntaTemplate = document.getElementById('pergunta-template');
  const opcaoTemplate = document.getElementById('opcao-template');

  // Configurar event listeners para perguntas existentes
  const existingPerguntas = perguntasContainer.querySelectorAll('.pergunta-item');
  existingPerguntas.forEach(function(perguntaItem) {
    setupPerguntaEvents(perguntaItem, perguntaItem.dataset.perguntaId);
  });

  // Adicionar pergunta
  addPerguntaBtn.addEventListener('click', function() {
    perguntaCount++;
    const perguntaHtml = perguntaTemplate.content.cloneNode(true);

    // Atualizar número da pergunta
---
SELECT COUNT(*) FROM "pergunta" WHERE "pergunta"."template_id" = 4