app/views/templates/index.html.erb

SELECT COUNT(*) FROM "pergunta" WHERE "pergunta"."template_id" = 1
---
                        <span class="badge bg-secondary fs-6">
                          <%= template.pergunta.count %> perguntas