app/views/templates/new.html.erb

SELECT "disciplinas".* FROM "disciplinas"
---
                    </span>
                    <%= form.select :disciplina_id,
                                    options_from_collection_for_select(current_user.disciplinas, :id, :nome),
                                    { prompt: "Selecione a disciplina" },
                                    { class: "form-select" } %>