app/views/templates/show.html.erb

  <div class="table-container">
    <h5>Perguntas do Template (<%= @template.pergunta.count %>)</h5>
---
SELECT "pergunta".* FROM "pergunta" WHERE "pergunta"."template_id" = 5 ORDER BY "pergunta"."id" ASC
SELECT COUNT(*) FROM "pergunta" WHERE "pergunta"."template_id" = 3

              <td>
                <% if pergunta.tipo == 'multipla_escolha' && pergunta.opcoes_pergunta.any? %>
---
SELECT "opcoes_pergunta".* FROM "opcoes_pergunta" WHERE "opcoes_pergunta"."pergunta_id" = 6
SELECT 1 AS one FROM "opcoes_pergunta" WHERE "opcoes_pergunta"."pergunta_id" = 6 LIMIT 1
SELECT COUNT(*) FROM "pergunta" WHERE "pergunta"."template_id" = 3

    <div class="card-body">
      <% if @template.pergunta.any? %>
        <% @template.pergunta.order(:id).each_with_index do |pergunta, index| %>
---
SELECT COUNT(*) FROM "pergunta" WHERE "pergunta"."template_id" = 4
SELECT "pergunta".* FROM "pergunta" WHERE "pergunta"."template_id" = 5 ORDER BY "pergunta"."id" ASC

            <!-- Opções para múltipla escolha -->
            <% if pergunta.multipla_escolha? && pergunta.opcoes_pergunta.any? %>
---
SELECT "opcoes_pergunta".* FROM "opcoes_pergunta" WHERE "opcoes_pergunta"."pergunta_id" = 6
SELECT 1 AS one FROM "opcoes_pergunta" WHERE "opcoes_pergunta"."pergunta_id" = 6 LIMIT 1