app/controllers/cursos_controller.rb

  def index
    @cursos = Curso.all
---
SELECT "cursos".* FROM "cursos"