app/controllers/cursos_controller.rb

SELECT "cursos".* FROM "cursos" ORDER BY "cursos"."nome" ASC
---
  def index
    @cursos = Curso.order(:nome)

SELECT "cursos".* FROM "cursos" WHERE "cursos"."id" = 1 LIMIT 1
---
  def set_curso
    @curso = Curso.find(params[:id])