app/controllers/disciplinas_controller.rb

SELECT "disciplinas".* FROM "disciplinas"
---
  def index
    @disciplinas = Disciplina.all