app/controllers/evaluations_controller.rb

SELECT "formularios".* FROM "formularios" WHERE "formularios"."ativo" = 1 AND (data_envio <= '2025-07-13 22:51:57.363758' AND data_fim >= '2025-07-13 22:51:57.363788')
SELECT "formularios".* FROM "formularios" WHERE "formularios"."ativo" = 1 AND (data_envio <= '2025-07-14 00:45:59.451090' AND data_fim >= '2025-07-14 00:45:59.451112')
SELECT "formularios".* FROM "formularios" WHERE "formularios"."ativo" = 1 AND (data_envio <= '2025-07-14 00:39:23.951080' AND data_fim >= '2025-07-14 00:39:23.951098')
---
  def index
    @formularios = if current_user.admin?
                     # Administradores veem todos os formulários ativos (sem filtro de período)
                     Formulario.where(ativo: true)
                   elsif current_user.coordenador?
                     # Coordenadores veem formulários que eles criaram ou que são da sua área
                     Formulario.where(ativo: true, coordenador: current_user)
                   else
                     # Usuários normais veem apenas formulários que podem responder
                     Formulario.ativos.no_periodo.select do |formulario|

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = 1 LIMIT 1
SELECT "pergunta".* FROM "pergunta" WHERE "pergunta"."id" = 9 LIMIT 1
---
  def show
    @formulario = Formulario.find(params[:id])

    # Verificar se o usuário pode ver este formulário
    unless @formulario.can_be_seen_by?(current_user)
      redirect_to evaluations_path, alert: 'Você não tem permissão para acessar este formulário.'
      return
    end

    # Verificar se já foi respondido
    if @formulario.already_answered_by?(current_user)
      redirect_to evaluations_path, notice: 'Você já respondeu este formulário.'
      return
    end

    @template = @formulario.template
    @perguntas = @template.pergunta.order(:id)

SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = 1 LIMIT 1
SELECT "pergunta".* FROM "pergunta" WHERE "pergunta"."template_id" = 10
SELECT "opcoes_pergunta".* FROM "opcoes_pergunta" WHERE "opcoes_pergunta"."pergunta_id" = 10
---
  def results
    @formulario = Formulario.find(params[:id])

    # Verificar se o usuário tem permissão para ver resultados
    unless current_user&.admin? || (current_user&.coordenador? && @formulario.coordenador == current_user)
      redirect_to evaluations_path, alert: 'Acesso negado. Você não tem permissão para ver estes resultados.'
      return
    end

    @template = @formulario.template

    # Buscar todas as respostas para este formulário
    @respostas = Respostum.where(formulario: @formulario)

    # Calcular estatísticas para cada pergunta
    @estatisticas = {}
    @template.pergunta.each do |pergunta|
      respostas_pergunta = @respostas.where(pergunta: pergunta)

      case pergunta.tipo
      when 'subjetiva'
        @estatisticas[pergunta.id] = {
          tipo: 'subjetiva',
          total_respostas: respostas_pergunta.count,
          respostas_texto: respostas_pergunta.where.not(resposta_texto: [nil, '']).pluck(:resposta_texto)
        }
      when 'multipla_escolha'
        opcoes_stats = {}
        pergunta.opcoes_pergunta.each do |opcao|