app/controllers/evaluations_controller.rb

INSERT INTO "resposta" ("formulario_id", "pergunta_id", "opcao_id", "resposta_texto", "turma_id", "uuid_anonimo", "created_at", "updated_at") VALUES (1, 9, NULL, 'sfdhgdkjgh', NULL, 'e4af4363-8835-460c-b20d-a7d9da48d607', '2025-07-14 00:02:54.519574', '2025-07-14 00:02:54.519574') RETURNING "id"
---
  def process_respostas
    begin
      ActiveRecord::Base.transaction do
        # Gerar UUID anônimo para o usuário (manter anonimato)
        uuid_anonimo = SecureRandom.uuid

        # Salvar cada resposta
        params[:respostas].each do |pergunta_id, resposta_texto|
          pergunta = Perguntum.find(pergunta_id)

          # Validar se a pergunta pertence ao formulário
          unless pergunta.template_id == @formulario.template_id
            raise ActiveRecord::RecordInvalid.new
          end

          # Criar resposta baseada no tipo de pergunta
          if pergunta.multipla_escolha?
            # Para múltipla escolha, resposta_texto é o ID da opção
            opcao = OpcoesPerguntum.find(resposta_texto)
            Respostum.create!(
              pergunta: pergunta,
              opcao: opcao,
              formulario: @formulario,
              uuid_anonimo: uuid_anonimo
            )
          else
            # Para verdadeiro/falso e subjetiva
            Respostum.create!(
              pergunta: pergunta,
              resposta_texto: resposta_texto,
              formulario: @formulario,
              uuid_anonimo: uuid_anonimo
            )