app/controllers/formularios_controller.rb

  def index
    @formularios = Formulario.all
---
SELECT "formularios".* FROM "formularios"

  def set_formulario
    @formulario = Formulario.find(params[:id])
---
SELECT "formularios".* FROM "formularios" WHERE "formularios"."id" = 1 LIMIT 1