app/controllers/minhas_disciplinas_controller.rb

SELECT "matriculas".* FROM "matriculas" WHERE "matriculas"."turma_id" IN (1, 2, 3)
SELECT DISTINCT "disciplinas".* FROM "disciplinas" INNER JOIN "turmas" ON "turmas"."disciplina_id" = "disciplinas"."id" INNER JOIN "matriculas" ON "matriculas"."turma_id" = "turmas"."id" WHERE "matriculas"."user_id" = 3
SELECT "turmas".* FROM "turmas" INNER JOIN "matriculas" ON "matriculas"."turma_id" = "turmas"."id" WHERE "turmas"."disciplina_id" = 1 AND "matriculas"."user_id" = 3
SELECT "turmas".* FROM "turmas" WHERE "turmas"."disciplina_id" = 1 AND "turmas"."professor_id" = 2
---
  def index
    case current_user.role
    when 'aluno'
      # Disciplinas em que o aluno está matriculado
      @disciplinas = Disciplina.joins(turmas: :matriculas)
                               .where(matriculas: { user_id: current_user.id })
                               .includes(:curso, turmas: %i[professor matriculas])
                               .distinct
      @page_title = 'Minhas Disciplinas - Aluno'
      @user_type = 'aluno'
    when 'professor'
      # Disciplinas que o professor leciona
      @disciplinas = Disciplina.joins(:turmas)
                               .where(turmas: { professor_id: current_user.id })
                               .includes(:curso, :turmas)
                               .distinct
      @page_title = 'Minhas Disciplinas - Professor'
      @user_type = 'professor'
    when 'admin'
      # Admin pode ver todas as disciplinas
      @disciplinas = Disciplina.includes(:curso, :turmas).all

SELECT COUNT(DISTINCT "disciplinas"."id") FROM "disciplinas" INNER JOIN "turmas" ON "turmas"."disciplina_id" = "disciplinas"."id" INNER JOIN "matriculas" ON "matriculas"."turma_id" = "turmas"."id" WHERE "matriculas"."user_id" = 3
SELECT COUNT(DISTINCT "turmas"."disciplina_id") FROM "matriculas" INNER JOIN "turmas" ON "turmas"."id" = "matriculas"."turma_id" WHERE "matriculas"."user_id" = 3
SELECT COUNT(DISTINCT "disciplinas"."id") FROM "disciplinas" INNER JOIN "turmas" ON "turmas"."disciplina_id" = "disciplinas"."id" INNER JOIN "matriculas" ON "matriculas"."turma_id" = "turmas"."id" LEFT OUTER JOIN "cursos" ON "cursos"."id" = "disciplinas"."curso_id" WHERE "turmas"."professor_id" = 2 AND "turmas"."professor_id" = 2
SELECT COUNT(DISTINCT "disciplinas"."id") FROM "turmas" INNER JOIN "disciplinas" ON "disciplinas"."id" = "turmas"."disciplina_id" WHERE "turmas"."professor_id" = 2
---
  def set_user_disciplinas
    @user_disciplinas_count = case current_user.role
                              when 'aluno'
                                current_user.matriculas.joins(:turma).distinct.count('turmas.disciplina_id')
                              when 'professor'
                                current_user.turmas_como_professor.joins(:disciplina).distinct.count('disciplinas.id')