app/controllers/templates_controller.rb

  def set_template
    @template = Template.find(params[:id])
---
SELECT "templates".* FROM "templates" WHERE "templates"."id" = 5 LIMIT 1

  def process_perguntas_update
    return unless params[:perguntas]

    Rails.logger.info '=== PROCESS PERGUNTAS UPDATE INICIADO ==='
    Rails.logger.info "Parâmetros recebidos: #{params[:perguntas].inspect}"

    # Mapear perguntas existentes por ID para fácil acesso
    perguntas_existentes = @template.pergunta.index_by(&:id)
    perguntas_processadas_ids = []

    params[:perguntas].each do |index, pergunta_attrs|
---
SELECT "pergunta".* FROM "pergunta" WHERE "pergunta"."template_id" = 10 AND "pergunta"."id" NOT IN (9, 10, 11, 12)