app/controllers/templates_controller.rb

SELECT "opcoes_pergunta".* FROM "opcoes_pergunta" WHERE "opcoes_pergunta"."pergunta_id" = 6
SELECT "pergunta".* FROM "pergunta" WHERE "pergunta"."template_id" = 5 ORDER BY "pergunta"."id" ASC
---
  def show
    @perguntas = @template.pergunta.ordenadas.includes(:opcoes_pergunta)

SELECT "opcoes_pergunta".* FROM "opcoes_pergunta" WHERE "opcoes_pergunta"."pergunta_id" = 5
SELECT "pergunta".* FROM "pergunta" WHERE "pergunta"."template_id" = 4 ORDER BY "pergunta"."id" ASC
---
  def edit
    @perguntas = @template.pergunta.ordenadas.includes(:opcoes_pergunta)

INSERT INTO "templates" ("titulo", "publico_alvo", "criado_por_id", "created_at", "updated_at", "descricao", "disciplina_id") VALUES ('test', 0, 1, '2025-07-12 20:56:17.200613', '2025-07-12 20:56:17.200613', '123', 1) RETURNING "id"
---
  def create
    @template = Template.new(template_params)
    @template.criado_por = current_user

    respond_to do |format|
      if @template.save

DELETE FROM "templates" WHERE "templates"."id" = 1
---
  def destroy
    @template.destroy!

SELECT "templates".* FROM "templates" WHERE "templates"."id" = 1 LIMIT 1
---
  def set_template
    @template = Template.find(params.expect(:id))

INSERT INTO "opcoes_pergunta" ("pergunta_id", "texto", "created_at", "updated_at") VALUES (13, 'A JCANOVCLKDL', '2025-07-13 21:41:21.934719', '2025-07-13 21:41:21.934719') RETURNING "id"
INSERT INTO "pergunta" ("template_id", "texto", "tipo", "created_at", "updated_at", "obrigatoria") VALUES (11, 'sdbjvsdbvjiscskn', 1, '2025-07-13 21:41:21.852174', '2025-07-13 21:41:21.852174', 1) RETURNING "id"
---
  def process_perguntas
    return unless params[:perguntas]

    params[:perguntas].each do |index, pergunta_attrs|
      next if pergunta_attrs[:texto].blank?

      pergunta = @template.pergunta.create!(
        texto: pergunta_attrs[:texto],
        tipo: pergunta_attrs[:tipo],
        obrigatoria: pergunta_attrs[:obrigatoria] == '1' || pergunta_attrs[:obrigatoria] == 'on'
      )

      # Criar opções se for múltipla escolha ou verdadeiro/falso
      if pergunta_attrs[:opcoes] && pergunta.multipla_escolha_ou_verdadeiro_falso?
        pergunta_attrs[:opcoes].each do |_, opcao_texto|
          next if opcao_texto.blank?
          pergunta.opcoes_pergunta.create!(texto: opcao_texto)

SELECT "pergunta".* FROM "pergunta" WHERE "pergunta"."id" = 13 LIMIT 1
UPDATE "pergunta" SET "texto" = 'Como foi a sua percepção sobre os alunos neste semestre ?', "updated_at" = '2025-07-13 21:15:38.640340' WHERE "pergunta"."id" = 9
DELETE FROM "opcoes_pergunta" WHERE "opcoes_pergunta"."id" = 3
INSERT INTO "pergunta" ("template_id", "texto", "tipo", "created_at", "updated_at", "obrigatoria") VALUES (5, 'você já tentou matar os alunos de tanto programar ?', 0, '2025-07-12 21:18:39.793473', '2025-07-12 21:18:39.793473', 1) RETURNING "id"
---
  def process_perguntas_update
    return unless params[:perguntas]

    # Coletar IDs das perguntas que foram enviadas
    pergunta_ids_enviadas = []

    params[:perguntas].each do |index, pergunta_attrs|
      next if pergunta_attrs[:texto].blank?

      if pergunta_attrs[:id].present?
        # Pergunta existente - atualizar
        pergunta = @template.pergunta.find(pergunta_attrs[:id])
        pergunta.update!(
          texto: pergunta_attrs[:texto],
          tipo: pergunta_attrs[:tipo],
          obrigatoria: pergunta_attrs[:obrigatoria] == '1' || pergunta_attrs[:obrigatoria] == 'on'
        )
        pergunta_ids_enviadas << pergunta.id

        # Remover opções existentes e recriar
        pergunta.opcoes_pergunta.destroy_all
      else
        # Nova pergunta - criar
        pergunta = @template.pergunta.create!(
          texto: pergunta_attrs[:texto],
          tipo: pergunta_attrs[:tipo],
          obrigatoria: pergunta_attrs[:obrigatoria] == '1' || pergunta_attrs[:obrigatoria] == 'on'
        )

INSERT INTO "pergunta" ("template_id", "texto", "tipo", "created_at", "updated_at", "obrigatoria") VALUES (11, 'FDBFGGJFJGXBBGHTGH???????????????????', 0, '2025-07-13 22:18:33.666831', '2025-07-13 22:18:33.666831', 1) RETURNING "id"
INSERT INTO "opcoes_pergunta" ("pergunta_id", "texto", "created_at", "updated_at") VALUES (4, '50%', '2025-07-12 21:20:38.439858', '2025-07-12 21:20:38.439858') RETURNING "id"
---
      if pergunta_attrs[:opcoes] && pergunta.multipla_escolha_ou_verdadeiro_falso?
        pergunta_attrs[:opcoes].each do |_, opcao_texto|
          next if opcao_texto.blank?
          pergunta.opcoes_pergunta.create!(texto: opcao_texto)

DELETE FROM "pergunta" WHERE "pergunta"."id" = 1
SELECT "pergunta".* FROM "pergunta" WHERE "pergunta"."template_id" = 5 AND "pergunta"."id" NOT IN (3, 4)
---
    end

    # Remover perguntas que não foram enviadas (foram deletadas no frontend)
    @template.pergunta.where.not(id: pergunta_ids_enviadas).destroy_all