app/controllers/users_controller.rb

  def index
    @users = User.all.order(:name)
---
SELECT "users".* FROM "users" ORDER BY "users"."name" ASC

  def create
    @user = User.new(user_params)
    @user.password = generate_temp_password if @user.password.blank?

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "password_digest", "name", "matricula", "role", "created_at", "updated_at") VALUES ('dev@outlook.com', '1234', 'Maria Valentina Ordonhes', '211212122', 1, '2025-07-09 00:22:41.723368', '2025-07-09 00:22:41.723368') RETURNING "id"

  def destroy
    @user.destroy!
---
DELETE FROM "users" WHERE "users"."id" = 3