app/controllers/users_controller.rb

  def adicionar_disciplina_aluno
    return redirect_to root_path, alert: 'Acesso negado.' unless current_user.admin?

    @user = User.find(params[:user_id])
    @turma = Turma.find(params[:turma_id])

    # Verificar se o aluno já está matriculado nesta turma
    if @user.matriculas.exists?(turma_id: @turma.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1